app/controllers/admin_controller.rb

  def index
    @employee = Employee.all
---
SELECT `employees`.* FROM `employees` WHERE (name = 'pranay' &z status='active' )

  def employee_status
    @emp = Employee.find(params[:id])
    if @emp.status == "active"

    Employee.update(params[:id],{:status=>"inactive"} )
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
UPDATE `employees` SET `status` = 'active', `updated_at` = '2012-08-14 04:57:03' WHERE `employees`.`id` = 1

  def show
    @emp = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def adddept

   @department=Department.all
---
SELECT `departments`.* FROM `departments`

   def update_dept

   	@dept = Department.find(params[:dept])

   	respond_to do |format|
   	@emp_update = Employee.update({:department_id => @dept.id},{:id=> @dept.employee.id})
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 'id' LIMIT 1
UPDATE `employees` SET user_id = NULL WHERE (deptartment_id= 1 )